{
    "label2index": {
        "<PAD>": 0,
        "$": 1,
        "a-0": 2,
        "a-1": 3,
        "a-2": 4,
        "a-3": 5,
        "a-4": 6,
        "a-5": 7,
        "aː-0": 8,
        "aː-1": 9,
        "aː-2": 10,
        "aː-3": 11,
        "aː-4": 12,
        "aː-5": 13,
        "e-0": 14,
        "e-1": 15,
        "e-2": 16,
        "e-3": 17,
        "e-4": 18,
        "e-5": 19,
        "eaː-0": 20,
        "eaː-1": 21,
        "eaː-2": 22,
        "eaː-3": 23,
        "eaː-4": 24,
        "eaː-5": 25,
        "f": 26,
        "h": 27,
        "i-0": 28,
        "i-1": 29,
        "i-2": 30,
        "i-3": 31,
        "i-4": 32,
        "i-5": 33,
        "iz": 34,
        "iə-0": 35,
        "iə-1": 36,
        "iə-2": 37,
        "iə-3": 38,
        "iə-4": 39,
        "iə-5": 40,
        "k": 41,
        "kpz": 42,
        "kz": 43,
        "k̟z": 44,
        "l": 45,
        "m": 46,
        "mz": 47,
        "n": 48,
        "nz": 49,
        "o-0": 50,
        "o-1": 51,
        "o-2": 52,
        "o-3": 53,
        "o-4": 54,
        "o-5": 55,
        "p": 56,
        "pz": 57,
        "s": 58,
        "t": 59,
        "tz": 60,
        "tʰ": 61,
        "t͡ɕ": 62,
        "u-0": 63,
        "u-1": 64,
        "u-2": 65,
        "u-3": 66,
        "u-4": 67,
        "u-5": 68,
        "uz": 69,
        "uə-0": 70,
        "uə-1": 71,
        "uə-2": 72,
        "uə-3": 73,
        "uə-4": 74,
        "uə-5": 75,
        "v": 76,
        "w": 77,
        "x": 78,
        "z": 79,
        "ŋ": 80,
        "ŋmz": 81,
        "ŋz": 82,
        "ŋ̟z": 83,
        "ɓ": 84,
        "ɔ-0": 85,
        "ɔ-1": 86,
        "ɔ-2": 87,
        "ɔ-3": 88,
        "ɔ-4": 89,
        "ɔ-5": 90,
        "ɗ": 91,
        "ə-0": 92,
        "ə-1": 93,
        "ə-2": 94,
        "ə-3": 95,
        "ə-4": 96,
        "ə-5": 97,
        "əː-0": 98,
        "əː-1": 99,
        "əː-2": 100,
        "əː-3": 101,
        "əː-4": 102,
        "əː-5": 103,
        "ɛ-0": 104,
        "ɛ-1": 105,
        "ɛ-2": 106,
        "ɛ-3": 107,
        "ɛ-4": 108,
        "ɛ-5": 109,
        "ɣ": 110,
        "ɨ-0": 111,
        "ɨ-1": 112,
        "ɨ-2": 113,
        "ɨ-3": 114,
        "ɨ-4": 115,
        "ɨ-5": 116,
        "ɨə-0": 117,
        "ɨə-1": 118,
        "ɨə-2": 119,
        "ɨə-3": 120,
        "ɨə-4": 121,
        "ɨə-5": 122,
        "ɲ": 123
    },
    "index2label": {
        "0": "<PAD>",
        "1": "$",
        "2": "a-0",
        "3": "a-1",
        "4": "a-2",
        "5": "a-3",
        "6": "a-4",
        "7": "a-5",
        "8": "aː-0",
        "9": "aː-1",
        "10": "aː-2",
        "11": "aː-3",
        "12": "aː-4",
        "13": "aː-5",
        "14": "e-0",
        "15": "e-1",
        "16": "e-2",
        "17": "e-3",
        "18": "e-4",
        "19": "e-5",
        "20": "eaː-0",
        "21": "eaː-1",
        "22": "eaː-2",
        "23": "eaː-3",
        "24": "eaː-4",
        "25": "eaː-5",
        "26": "f",
        "27": "h",
        "28": "i-0",
        "29": "i-1",
        "30": "i-2",
        "31": "i-3",
        "32": "i-4",
        "33": "i-5",
        "34": "iz",
        "35": "iə-0",
        "36": "iə-1",
        "37": "iə-2",
        "38": "iə-3",
        "39": "iə-4",
        "40": "iə-5",
        "41": "k",
        "42": "kpz",
        "43": "kz",
        "44": "k̟z",
        "45": "l",
        "46": "m",
        "47": "mz",
        "48": "n",
        "49": "nz",
        "50": "o-0",
        "51": "o-1",
        "52": "o-2",
        "53": "o-3",
        "54": "o-4",
        "55": "o-5",
        "56": "p",
        "57": "pz",
        "58": "s",
        "59": "t",
        "60": "tz",
        "61": "tʰ",
        "62": "t͡ɕ",
        "63": "u-0",
        "64": "u-1",
        "65": "u-2",
        "66": "u-3",
        "67": "u-4",
        "68": "u-5",
        "69": "uz",
        "70": "uə-0",
        "71": "uə-1",
        "72": "uə-2",
        "73": "uə-3",
        "74": "uə-4",
        "75": "uə-5",
        "76": "v",
        "77": "w",
        "78": "x",
        "79": "z",
        "80": "ŋ",
        "81": "ŋmz",
        "82": "ŋz",
        "83": "ŋ̟z",
        "84": "ɓ",
        "85": "ɔ-0",
        "86": "ɔ-1",
        "87": "ɔ-2",
        "88": "ɔ-3",
        "89": "ɔ-4",
        "90": "ɔ-5",
        "91": "ɗ",
        "92": "ə-0",
        "93": "ə-1",
        "94": "ə-2",
        "95": "ə-3",
        "96": "ə-4",
        "97": "ə-5",
        "98": "əː-0",
        "99": "əː-1",
        "100": "əː-2",
        "101": "əː-3",
        "102": "əː-4",
        "103": "əː-5",
        "104": "ɛ-0",
        "105": "ɛ-1",
        "106": "ɛ-2",
        "107": "ɛ-3",
        "108": "ɛ-4",
        "109": "ɛ-5",
        "110": "ɣ",
        "111": "ɨ-0",
        "112": "ɨ-1",
        "113": "ɨ-2",
        "114": "ɨ-3",
        "115": "ɨ-4",
        "116": "ɨ-5",
        "117": "ɨə-0",
        "118": "ɨə-1",
        "119": "ɨə-2",
        "120": "ɨə-3",
        "121": "ɨə-4",
        "122": "ɨə-5",
        "123": "ɲ"
    },
    "n_class": 124
}